src/main/webapp/META-INF/upload-report-v1.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.10 svn-revision#919b322c92f13ad085a933e8dd6dd35d4947364b. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.10 svn-revision#919b322c92f13ad085a933e8dd6dd35d4947364b. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://irixservice.intevation.de/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://irixservice.intevation.de/" name="UploadReportService">
<types>
<xsd:schema>
<xsd:import namespace="http://www.w3.org/2000/09/xmldsig#"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://www.iaea.org/2012/IRIX/Format/ResponseActions"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://www.iaea.org/2012/IRIX/Format/Requests"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://www.iaea.org/2012/IRIX/Format/ReleaseInformation"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://www.iaea.org/2012/IRIX/Format/Meteorology"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://www.iaea.org/2012/IRIX/Format/MedicalInformation"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://www.iaea.org/2012/IRIX/Format/MediaInformation"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://www.iaea.org/2012/IRIX/Format/Measurements"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://www.iaea.org/2012/IRIX/Format/Locations"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://www.iaea.org/2012/IRIX/Format/Identification"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://www.iaea.org/2012/IRIX/Format/EventInformation"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://www.iaea.org/2012/IRIX/Format/ConsequenceInformation"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://www.iaea.org/2012/IRIX/Format/Base"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://www.iaea.org/2012/IRIX/Format/Annexes"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://www.iaea.org/2012/IRIX/Format"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://irixservice.intevation.de/" schemaLocation="upload-report.xsd"/>
</xsd:schema>
</types>
<message name="uploadReport">
<part name="parameters" element="tns:uploadReport"/>
</message>
<message name="uploadReportResponse">
<part name="parameters" element="tns:uploadReportResponse"/>
</message>
<message name="UploadReportException">
<part name="fault" element="tns:UploadReportException"/>
</message>
<portType name="UploadReportInterface">
<operation name="uploadReport">
<input wsam:Action="http://irixservice.intevation.de/UploadReportInterface/uploadReportRequest" message="tns:uploadReport"/>
<output wsam:Action="http://irixservice.intevation.de/UploadReportInterface/uploadReportResponse" message="tns:uploadReportResponse"/>
<fault message="tns:UploadReportException" name="UploadReportException" wsam:Action="http://irixservice.intevation.de/UploadReportInterface/uploadReport/Fault/UploadReportException"/>
</operation>
</portType>
<binding name="UploadReportPortBinding" type="tns:UploadReportInterface">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="uploadReport">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="UploadReportException">
<soap:fault name="UploadReportException" use="literal"/>
</fault>
</operation>
</binding>
<service name="UploadReportService">
<port name="UploadReportPort" binding="tns:UploadReportPortBinding">
<soap:address location="http://localhost:8080/irix-webservice/upload-report"/>
</port>
</service>
</definitions>
